In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Age": [25, 32, 22, 35, 47],
    "Score": [85, 63, 77, 96, 54]
})

In [3]:
df

      Name  Age  Score
0    Alice   25     85
1      Bob   32     63
2  Charlie   22     77
3    David   35     96
4      Eve   47     54

In [5]:
my_df = pd.read_csv('my_df.csv', index_col=0)

In [6]:
my_df

          Quantity   Color  Price_per_kg
Apples          20     Red             3
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [7]:
my_df.head(2)

         Quantity   Color  Price_per_kg
Apples         20     Red             3
Bananas        30  Yellow             2

In [10]:
my_df.tail(3)

          Quantity   Color  Price_per_kg
Bananas         30  Yellow             2
Cherries        15     Red             4
Dates           10   Brown             5

In [11]:
my_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, Apples to Dates
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Quantity      4 non-null      int64
 1   Color         4 non-null      object
 2   Price_per_kg  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 128.0+ bytes

In [12]:
my_df.describe()

        Quantity  Price_per_kg
count   4.000000      4.000000
mean   18.750000      3.500000
std     8.539126      1.290994
min    10.000000      2.000000
25%    13.750000      2.750000
50%    17.500000      3.500000
75%    22.500000      4.250000
max    30.000000      5.000000

In [13]:
my_df.nlargest(3, 'Price_per_kg')

          Quantity  Color  Price_per_kg
Dates           10  Brown             5
Cherries        15    Red             4
Apples          20    Red             3

In [23]:
my_df.iloc[1,0]

30

In [20]:
my_df.loc["Bananas",'Quantity']

30

In [ ]:
my_df.rename()